УТ.РасширениеКонтурЛогистика/src/InformationRegisters/КонтурЛогистика_УИДыГИС/КонтурЛогистика_УИДыГИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_УИДыГИС</name>
  <comment>Хранит пул доступных для использования УИДов минтранса</comment>
  <resources>
    <name>Использован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаОперации</name>
    <comment>Дата операции добавления / использования</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.РасширениеКонтурЛогистика/src/InformationRegisters/КонтурЛогистика_УИДыГИС/Forms/ФормаЗагрузкиПулаУИД/Module.bsl
&НаКлиенте
Процедура Распознать(Команда)
	
	РаспознанныеУИД.Очистить();
	
	МассивУИД = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазделитьСтроку(ТекстСКодами, "," + Символы.ПС + " ", Ложь);
	
	ПроверитьЗагрузитьУИДы(МассивУИД);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗагрузитьУИДы(МассивУИД)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УИДы.УИД КАК УИД
	               |ПОМЕСТИТЬ ВТ_УИДы
	               |ИЗ
	               |	&УИДы КАК УИДы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_УИДы.УИД КАК УИД,
	               |	ВЫБОР
	               |		КОГДА КонтурЛогистика_УИДыГИС.Использован ЕСТЬ NULL
	               |			ТОГДА ""ОК""
	               |		КОГДА КонтурЛогистика_УИДыГИС.Использован = ИСТИНА
	               |			ТОГДА ""Уже использован""
	               |		ИНАЧЕ ""Уже был загружен""
	               |	КОНЕЦ КАК Статус
	               |ИЗ
	               |	ВТ_УИДы КАК ВТ_УИДы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_УИДыГИС КАК КонтурЛогистика_УИДыГИС
	               |		ПО ВТ_УИДы.УИД = КонтурЛогистика_УИДыГИС.УИД";
	
	ТабУиды = новый ТаблицаЗначений;
	ТабУиды.Колонки.Добавить("УИД", Новый ОписаниеТипов("Строка", ,
									Новый КвалификаторыСтроки(36, ДопустимаяДлина.Фиксированная)));
	Для й=1 По МассивУИД.Количество() Цикл
	    ТабУиды.Добавить();
	КонецЦикла;	
	ТабУиды.ЗагрузитьКолонку(МассивУИД, "УИД");
	Запрос.УстановитьПараметр("УИДы", ТабУиды);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	й = 0;
	Пока Выборка.Следующий() Цикл
		
		й = й + 1;
		НоваяСТрокаУИД = РаспознанныеУИД.Добавить();
		НоваяСТрокаУИД.НомерСтроки = й;
		НоваяСТрокаУИД.УИД = Выборка.УИД;
		НоваяСТрокаУИД.Статус = Выборка.Статус;
		
		Если СтрДлина(СокрЛП(НоваяСТрокаУИД.УИД)) <> 36 Тогда 
			НоваяСТрокаУИД.Статус = "Длина не равна 36";
		КонецЕсли;
		
	КонецЦикла;
	
	Если РаспознанныеУИД.НайтиСтроки(Новый Структура("Статус", "ОК")).Количество() <> РаспознанныеУИД.Количество() Тогда
		Сообщить("ВНИМАНИЕ Есть ошибочные УИД");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере()
	
	Для Каждого СтрокаУИД из РаспознанныеУИД Цикл 
		
		Попытка
			
			Если СтрокаУИД.Статус = "ОК" Тогда 
				
				МенеджерЗаписи = РегистрыСведений.КонтурЛогистика_УИДыГИС.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.УИД = СтрокаУИД.УИД;
				МенеджерЗаписи.Организация = Организация;
				МенеджерЗаписи.ДатаОперации = ТекущаяДатаСеанса();
				МенеджерЗаписи.Записать(Ложь);
				
				СтрокаУИД.Статус = "Загружен";
				
			КонецЕсли;
		
		Исключение
		   	Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если Не ЗначениеЗаполнено(Организация) Тогда 
		Сообщить("Выберите организацию");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьНаСервере();
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.КонтурЛогистика_УИДыГИС"));
	
КонецПроцедуры

&НаКлиенте
Процедура РаспознанныеУИДПриИзменении(Элемент)
		
	Если СтрДлина(СокрЛП(Элемент.ТекущиеДанные.УИД)) <> 36 Тогда 
		Элемент.ТекущиеДанные.Статус = "Длина не равна 36";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НастройкиКД = Новый НастройкиКомпоновкиДанных;
	
	ДоступныеОрганизации = НашиОрганизации();
	ОтборСписка = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборСписка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ОтборСписка.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборСписка.ПравоеЗначение = ДоступныеОрганизации;
	ОтборСписка.Использование = Истина;
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("ФиксированныеНастройки", НастройкиКД);
	ПараметрыВыбора.Вставить("СкрытьОтбор");
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Справочник.КонтурЛогистика_ОрганизацииДиадок.Форма.ФормаВыбора", ПараметрыВыбора, ЭтаФорма, ЭтаФорма, "ОбработчикВыбораОрганизации");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораОрганизации(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Организация = ВыбранноеЗначение;
			
КонецПроцедуры

&НаСервереБезКонтекста
Функция НашиОрганизации()	
	Возврат Справочники.КонтурЛогистика_ОрганизацииДиадок.ВсеНашиОрганизации();			
КонецФункции
